# Pandas Operasyonlar

## Eksik Veriler

In [11]:
import pandas as pd
import numpy as np

In [12]:
sozlukVerisi = {"Istanbul": [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmır" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [13]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [14]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmır
0      30.0    20.0     40

In [15]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmır
0     40
1     39
2     38

In [16]:
havaDurumuDataFrame.dropna(axis = 0)

   Istanbul  Ankara  Izmır
0      30.0    20.0     40

In [18]:
yeniSozlukVerisi = {"Istanbul": [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmır" : [40,39,38], "Antalya" : [45,np.nan,np.nan]}
yeniHavaDurumuDataFrame = pd.DataFrame(yeniSozlukVerisi)

In [19]:
yeniHavaDurumuDataFrame

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [20]:
yeniHavaDurumuDataFrame.dropna(axis = 1, thresh=2)

   Istanbul  Ankara  Izmır
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [25]:
yeniHavaDurumuDataFrame.fillna(20)

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     39     20.0
2      20.0    25.0     38     20.0

## Groupby (Gruplandırmak)

In [27]:
maasSozlugu = {"Departman" : ["Yazılım", "Yazılım", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"],
               "Çalışan İsmi" : ["Ahmet", "Mehmet", "Atıl", "Burak", "Zeynep", "Fatma"],
               "Maaş" : [100, 150, 200, 300, 400, 500]
              
              }

In [28]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [29]:
maasDataFrame

   Departman Çalışan İsmi  Maaş
0    Yazılım        Ahmet   100
1    Yazılım       Mehmet   150
2  Pazarlama         Atıl   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [31]:
grupObjesi = maasDataFrame.groupby("Departman")

In [32]:
grupObjesi.count()

           Çalışan İsmi  Maaş
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazılım               2     2

In [33]:
grupObjesi.mean()

            Maaş
Departman
Hukuk      450.0
Pazarlama  250.0
Yazılım    125.0

In [34]:
grupObjesi.min()

          Çalışan İsmi  Maaş
Departman
Hukuk            Fatma   400
Pazarlama         Atıl   200
Yazılım          Ahmet   100

In [35]:
grupObjesi.max()

          Çalışan İsmi  Maaş
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazılım         Mehmet   150

In [36]:
grupObjesi.describe()

           Maaş
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazılım     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0